docs/assign08.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-07 Wed 14:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SWE 619 Assignment 8</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThanhVu (Vu) Nguyen" />
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
</head>
<body>
<div id="content">
<h1 class="title">SWE 619 Assignment 8</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd8c2a53">1. Goals: Generics</a></li>
<li><a href="#org15211a8">2. Grading Criteria</a></li>
<li><a href="#org9fb4371">3. Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd8c2a53" class="outline-2">
<h2 id="orgd8c2a53"><span class="section-number-2">1</span> Goals: Generics</h2>
<div class="outline-text-2" id="text-1">
<p>
Consider the <a href="./files/BoundedQueue.java">BoundedQueue</a> example from in-class exercise <a href="./inclass08C.html">#8C</a>.
</p>

<p>
Complete the generic part of the exercise: The result should be fully generic, and there should not be any compiler warnings. You should adopt Bloch's advice about lists vs. arrays; doing so will eliminate the need for many of the instance variables.
</p>

<p>
Keep the same methods, but update the behavior (and document with contracts!) to include exception handling for all cases not on the happy path.
</p>

<p>
Include the constructor in your considerations. In particular, consider whether you think a zero-sized buffer is a reasonable possibility. Document your reasoning. This is less about a right vs. wrong answer than a careful consideration of the consequences of the decision.
</p>

<p>
Add <code>putAll()</code> and <code>getAll()</code>. Define the method signatures carefully. Use exception-handling consistent with that for <code>get()</code> and <code>put()</code>. Use bounded wildcards as appropriate. Note that <code>putAll()</code> has a special case where there isn't sufficient space in the bounded queue. Adopt a solution you think Bloch and/or Liskov would approve of. In particular, Bloch prefers that when methods throw exceptions, there is no change to the state of the object.
</p>
</div>
</div>


<div id="outline-container-org15211a8" class="outline-2">
<h2 id="org15211a8"><span class="section-number-2">2</span> Grading Criteria</h2>
<div class="outline-text-2" id="text-2">
<p>
As before, turn in a clear, concise story demonstrating completion of the assignment.
</p>
</div>
</div>

<div id="outline-container-org9fb4371" class="outline-2">
<h2 id="org9fb4371"><span class="section-number-2">3</span> Links</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="./index.html">Syllabus</a></li>
<li><a href="./schedule.html">Schedule</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
